'use strict'

/**
 * Arrays below can contain HTML elements for text formatting
 **/

export const informaMessagesLimitReachedStrings = [
  'Знаешь, моя основная задача показывать ближайшие события, показать?',
  'Может все-таки я покажу тебе что у нас есть интересного?',
  'Давай вернемся к событиям города, показать что-то классное?',
]

export const handleNoForCategoriesStrings = [
  'Эх, жаль, а у меня столько всего было тебе показать :disappointed_relieved:',
  'Ну ладно :disappointed: тогда я пошел рыдать в свой угол',
  'Но ведь столько интересного вокруг... :sob: а ты все пропустишь :sob:',
  ':crying_cat_face: эх, придется мне снова от тоски перебирать свои байты',
]

export const handleUnknownForCategoriesStrings = [
  'Кажется, я тебя не понимаю, хочешь посмотреть или нет?',
  'Давай как-то конкретнее, да или нет?',
]

export const greetings = [
  'Привет-привет :yum:',
  'Ку-ку :no_mouth:',
  'А вот и Левша :hand:',
  'Эхей, Левша на связи!',
  'Привет :smirk_cat:!',
  'Добрый день по ту сторону экрана.',
  'А вот и мой любимый пользователь.',
]

export const weekDaysNotificationsStrings = {
  0: [ // Sunday
    'Свежая подборка на воскресенье готова :point_up: интересно?',
    'Как проходит воскресенье? :smiley_cat: Хочешь посмотреть :star: события в городе?',
  ],
  1: [ // Monday
    'У меня тут тайные события (нашел в тайных источниках в выходные), давай покажу?',
    'Снова неожиданно пришел понедельник :cry:? Не отчаивайся :yum:, интересные мероприятия жду тебя! Смотрим?',
  ],
  2: [ // Tuesday
    ':point_up: Пришло время узнать, чем заняться во вторник, погнали?',
    'Я подготовил тебе отличные события, хочешь увидеть?',
  ],
  3: [ // Wednesday
    'Наконец середина недели :smirk_cat:, время перевести дух и посмотреть что-то интересное, :tongue: интересно?',
    'Ну что же, я готов похвастаться новыми событиями :tada:, ты со мной?',
  ],
  4: [ // Thursday
    'Вот и пришел четверг :construction:, просто четверг, но масса мероприятий все еще ждут, показывать?',
    'Рабочая неделя на финишной прямой :laughing:, показать что-то занятное?',
  ],
  5: [ // Friday
    'Счастливой пятницы :heart:! Самые яркие :zap: события собраны, смотрим?',
    'Самые :fire: моменты ждут тебя, поехали?',
  ],
  6: [ // Saturday
    'Наконец выходные! Время выбраться :bus: и узнать что-то новое или может просто развлечься :performing_arts:?',
    'Время активного отдыха, посмотришь субботнюю подборку :books:?',
  ],
}